<a href="https://colab.research.google.com/github/discipulum/discipulum/blob/master/prueba_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
dataset = pd.read_csv("titanic.csv")

In [ ]:
dataset.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [ ]:
dataset.tail(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[10 rows x 12 columns]

In [ ]:
dataset.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
dataset.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
# NA

dataset.Age.fillna(value=dataset.Age.mean(), inplace=True)
dataset.Fare.fillna(value=dataset.Fare.mean(), inplace=True)
dataset.Embarked.fillna(value=(dataset.Embarked.value_counts().idxmax()), inplace=True)

dataset.Survived.fillna(value=-1, inplace=True)

In [ ]:
# family size

fsiz = pd.DataFrame(dataset.apply(lambda x: x.SibSp+x.Parch, axis=1), columns=["Family_Size"])
data = dataset.join(fsiz)

In [ ]:
# drop useless columns
data.drop('Name', axis=1, inplace=True)
data.drop('Cabin', axis=1, inplace=True)
data.drop('Ticket', axis=1, inplace=True)

data.drop('Parch', axis=1, inplace=True)
data.drop('SibSp', axis=1, inplace=True)

data.drop('PassengerId', axis=1, inplace=True)

In [ ]:
data.head(3)

   Survived  Pclass     Sex   Age     Fare Embarked  Family_Size
0         0       3    male  22.0   7.2500        S            1
1         1       1  female  38.0  71.2833        C            1
2         1       3  female  26.0   7.9250        S            0

In [ ]:
data.dtypes

Survived         int64
Pclass           int64
Sex             object
Age            float64
Fare           float64
Embarked        object
Family_Size      int64
dtype: object

In [ ]:
for col in data.select_dtypes(exclude=["number"]).columns:
    print("Converting column "+col+"...")
    data[col] = data[col].astype('category')    
    print(data[col].cat.categories)
    data[col] = data[col].cat.codes

Converting column Sex...
Index(['female', 'male'], dtype='object')
Converting column Embarked...
Index(['C', 'Q', 'S'], dtype='object')

In [ ]:
data.dtypes

Survived         int64
Pclass           int64
Sex               int8
Age            float64
Fare           float64
Embarked          int8
Family_Size      int64
dtype: object

In [ ]:
data.tail(5)

     Survived  Pclass  Sex        Age   Fare  Embarked  Family_Size
886         0       2    1  27.000000  13.00         2            0
887         1       1    0  19.000000  30.00         2            0
888         0       3    0  29.699118  23.45         2            3
889         1       1    1  26.000000  30.00         0            0
890         0       3    1  32.000000   7.75         1            0

In [ ]:
# Y = f(X)

Y = data["Survived"]
X = data.drop("Survived", axis = 1)

In [ ]:
print(X.shape, Y.shape)

(891, 6) (891,)

In [ ]:
# SCIKIT LEARN
import sklearn

In [ ]:
# training y testing

from sklearn.model_selection import train_test_split

In [ ]:
TRAIN_SIZE = 0.8
TESTING_SIZE = 0.2

In [ ]:
x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=TESTING_SIZE, random_state=42)

In [ ]:
print(x_train.shape, y_train.shape)

(712, 6) (712,)

In [ ]:
print(x_test.shape, y_test.shape)

(179, 6) (179,)

In [ ]:
# ARBOL DECISIONES  - DECISION TREE

# sklearn
from sklearn.tree import DecisionTreeClassifier

In [ ]:
modelo_1 = DecisionTreeClassifier(random_state=0)

In [ ]:
modelo_1.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=0, splitter='best')

In [ ]:
print(modelo_1.score(x_train, y_train))

0.9803370786516854

In [ ]:
# RANDOM FOREST

# sklearn 
from sklearn.ensemble import RandomForestClassifier

In [ ]:
modelo_2 = RandomForestClassifier(n_estimators=15)

In [ ]:
modelo_2.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=15,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [ ]:
print(modelo_2.score(x_train, y_train))

0.9747191011235955

In [ ]:
# EVALUACION

In [ ]:
# testing dataset 

print("Decision Tree: ")
print(modelo_1.score(x_test, y_test))

Decision Tree:
0.7653631284916201

In [ ]:
print("Random Forest: ")
print(modelo_2.score(x_test, y_test))

Random Forest:
0.7877094972067039

In [ ]:
# matriz de confusion

from sklearn.metrics import confusion_matrix

In [ ]:
y_pred_m1 = modelo_1.predict(x_test)

In [ ]:
y_pred_m2 = modelo_2.predict(x_test)

In [ ]:
# Decision Tree

confusion_matrix(y_test, y_pred_m1)

array([[84, 21],
       [21, 53]])

In [ ]:
# Random Forest

confusion_matrix(y_test, y_pred_m2)

array([[86, 19],
       [19, 55]])